app/Controllers/Clientes.php


        else:

            $data['clientes'] = $this->cliente_model
                                    ->where('id_contador', $this->id_contador)
                                    ->where('id_empresa', $this->id_empresa)
                                    ->limit(10)
                                    ->orderBy('id_cliente', 'DESC')
                                    ->find();
---
SELECT *
FROM `clientes`
WHERE `id_contador` = '1'
AND `id_empresa` = '3'
ORDER BY `id_cliente` DESC
 LIMIT 10