app/Controllers/Empresas.php

SELECT *
FROM `empresas`
WHERE `id_contador` = '1'
---

        else:

            $data['empresas'] = $this->empresa_model
                                    ->where('id_contador', $this->id_contador)
                                    ->findAll();

INSERT INTO `logins` (`usuario`, `senha`, `tipo`, `created_at`, `updated_at`) VALUES ('empresa', '123', 3, '2024-02-27 03:36:04', '2024-02-27 03:36:04')
INSERT INTO `empresas` (`CNPJ`, `xNome`, `xFant`, `IE`, `dia_do_pagamento`, `CEP`, `xLgr`, `xCpl`, `xBairro`, `id_uf`, `id_municipio`, `fone`, `natOp`, `serie`, `tpAmb_NFe`, `nNF_homologacao`, `tpAmb_NFCe`, `nNFC_homologacao`, `CSC`, `CSC_Id`, `senha_do_certificado`, `id_contador`, `status`, `nro`, `certificado`, `id_login`, `created_at`, `updated_at`) VALUES ('34229323000173', 'NXSISTEMAS ERP LTDA', 'NXSISTEMAS ERP LTDA', '564897456', '10', '77060334', 'Avenida Contorno', 'APT 304 BLOCO 04', 'Jardim Santa Bárbara', '17', '399', '63984465398', 'Venda de mercadorias.', '1', '2', '1', '2', '1', '', '', '123', '1', 'Ativo', 'S/N', '2702202403360396676878.pfx', 5, '2024-02-27 03:36:04', '2024-02-27 03:36:04')
---

            $dados['tipo'] = 3; // Informa o tipo. 3=empresa

            $id_login = $this->login_model
                            ->insert($dados);

            $dados['id_login'] = $id_login;

            $this->empresa_model
                ->insert($dados);