app/Controllers/Inicio.php

SELECT *
FROM `empresas`
WHERE `id_contador` = '1'
AND `id_empresa` = '3'
 LIMIT 1
SELECT *
FROM `nfes`
WHERE `id_contador` = '1'
AND `id_empresa` = '3'
AND `tipo` = 1
SELECT *
FROM `nfes`
WHERE `id_contador` = '1'
AND `id_empresa` = '3'
AND `tipo` = 2
SELECT *
FROM `nfes`
WHERE `id_contador` = '1'
AND `id_empresa` = '3'
AND `tipo` = 3
SELECT *
FROM `nfces`
WHERE `id_contador` = '1'
AND `id_empresa` = '3'
---
    public function emissor()
    {
        // Verifica se o usuário tem permissão de acessar essa url
        if($retorno = verificaPermissaoDeAcesso(3)) :
            return redirect()->to($retorno);
        endif;

        $data['link'] = $this->link;

        // Pega primeiro o contador e depois a empresa desse contador, para não perder o desempenho na consulta.
        $data['dados_da_empresa'] = $this->empresa_model
                                        ->where('id_contador', $this->id_contador)
                                        ->where('id_empresa', $this->id_empresa)
                                        ->first();

        // Total de NFe de entrada
        $data['total_nfe_entrada_emitidas'] = count($this->nfe_model
                                                    ->where('id_contador', $this->id_contador)
                                                    ->where('id_empresa', $this->id_empresa)
                                                    ->where('tipo', 1) // 1=Entrada
                                                    ->findAll());

        // Total de NFe de entrada
        $data['total_nfe_saidas_emitidas'] = count($this->nfe_model
                                                    ->where('id_contador', $this->id_contador)
                                                    ->where('id_empresa', $this->id_empresa)
                                                    ->where('tipo', 2) // 2=Saída
                                                    ->findAll());

        // Total de NFe de entrada
        $data['total_nfe_devolucao_emitidas'] = count($this->nfe_model
                                                    ->where('id_contador', $this->id_contador)
                                                    ->where('id_empresa', $this->id_empresa)
                                                    ->where('tipo', 3) // 3=Devolução
                                                    ->findAll());

        // Total de NFCe emitidas
        $data['total_nfce_emitidas'] = count($this->nfce_model
                                            ->where('id_contador', $this->id_contador)
                                            ->where('id_empresa', $this->id_empresa)
                                            ->findAll());

SELECT *
FROM `nfes`
WHERE `id_contador` = '1'
AND `id_empresa` = '3'
AND `data` >= '2024-01-01'
AND `data` <= '2024-01-31'
SELECT *
FROM `nfces`
WHERE `id_contador` = '1'
AND `id_empresa` = '3'
AND `data` >= '2024-01-01'
AND `data` <= '2024-01-31'
---
            $data_inicio = date('Y')."-{$mes['mes']}-01";
            $data_final  = date('Y')."-{$mes['mes']}-31";

            $notas_nfe = $this->nfe_model
                                ->where('id_contador', $this->id_contador)
                                ->where('id_empresa', $this->id_empresa)
                                ->where('data >=', $data_inicio)
                                ->where('data <=', $data_final)
                                ->findAll();

            $notas_nfce = $this->nfce_model
                                ->where('id_contador', $this->id_contador)
                                ->where('id_empresa', $this->id_empresa)
                                ->where('data >=', $data_inicio)
                                ->where('data <=', $data_final)
                                ->findAll();

SELECT SUM(`valor_da_nota`) AS `valor_da_nota`
FROM `nfes`
WHERE `id_contador` = '1'
AND `id_empresa` = '3'
AND `data` >= '2024-01-01'
AND `data` <= '2024-01-31'
SELECT SUM(`valor_da_nota`) AS `valor_da_nota`
FROM `nfces`
WHERE `id_contador` = '1'
AND `id_empresa` = '3'
AND `data` >= '2024-01-01'
AND `data` <= '2024-01-31'
---
            $data_inicio = date('Y')."-{$mes['mes']}-01";
            $data_final  = date('Y')."-{$mes['mes']}-31";

            $notas_nfe = $this->nfe_model
                                ->where('id_contador', $this->id_contador)
                                ->where('id_empresa', $this->id_empresa)
                                ->where('data >=', $data_inicio)
                                ->where('data <=', $data_final)
                                ->selectSum('valor_da_nota')
                                ->findAll()[0]['valor_da_nota'];

            $notas_nfce = $this->nfce_model
                                ->where('id_contador', $this->id_contador)
                                ->where('id_empresa', $this->id_empresa)
                                ->where('data >=', $data_inicio)
                                ->where('data <=', $data_final)
                                ->selectSum('valor_da_nota')
                                ->findAll()[0]['valor_da_nota'];