app/Controllers/Login.php

    public function autenticar()
    {
        $dados = $this->request
                        ->getvar();

        $login = $this->login_model
                    ->where('usuario', $dados['usuario'])
                    ->where('senha', $dados['senha'])
                    ->first();
---
SELECT *
FROM `logins`
WHERE `usuario` = 'empresa'
AND `senha` = '123'
 LIMIT 1


            elseif($login['tipo'] == 3) :
                // Caso o tipo for 3 (Emissor) então pega o id_empresa e coloca também na sessão
                $empresa = $this->empresa_model
                                ->where('id_login', $login['id_login'])
                                ->first();
---
SELECT *
FROM `empresas`
WHERE `id_login` = '5'
 LIMIT 1

    public function verificaUsuario()
    {
        $dados = $this->request
                        ->getvar();

        $usuario = $this->login_model
                        ->where('usuario', $dados['usuario'])
                        ->first();
---
SELECT *
FROM `logins`
WHERE `usuario` = 'empresa'
 LIMIT 1