app/Controllers/Produtos.php

SELECT *
FROM `produtos`
JOIN `unidades` ON `produtos`.`id_unidade` = `unidades`.`id_unidade`
WHERE `id_contador` = '1'
AND `id_empresa` = '3'
ORDER BY `id_produto` DESC
 LIMIT 10
---

        else:

            $data['produtos'] = $this->produto_model
                                    ->where('id_contador', $this->id_contador)
                                    ->where('id_empresa', $this->id_empresa)
                                    ->limit(10)
                                    ->orderBy('id_produto', 'DESC')
                                    ->join('unidades', 'produtos.id_unidade = unidades.id_unidade')
                                    ->find();

SELECT *
FROM `unidades`
---
    public function create()
    {
        // Verifica se o usuário tem permissão de acessar essa url
        if($retorno = verificaPermissaoDeAcesso($this->tipo)) :
            return redirect()->to($retorno);
        endif;

        $data['link'] = $this->link;

        $data['titulo'] = [
            'modulo' => 'Novo Produto',
            'icone'  => 'fa fa-plus-circle'
        ];

        $data['caminhos'] = [
            ['titulo' => "Início", 'rota' => "/inicio/emissor", 'active' => false],
            ['titulo' => "Produtos", 'rota' => "/produtos", 'active' => false],
            ['titulo' => "Novo", 'rota'   => "", 'active' => true]
        ];

        $data['unidades'] = $this->unidade_model
                                ->findAll();

INSERT INTO `produtos` (`nome`, `id_unidade`, `valor_unitario`, `CFOP_NFe`, `CFOP_NFCe`, `CFOP_Externo`, `NCM`, `CSOSN`, `id_contador`, `id_empresa`, `codigo_de_barras`, `created_at`, `updated_at`) VALUES ('PRODUTO TESTE', '2', '545.45', '5403', '5102', '6104', '27111910', '103', '1', '3', 'SEM GTIN', '2024-02-27 03:36:35', '2024-02-27 03:36:35')
---
        endif;

        // Caso ação é cadastrar
        $this->produto_model
            ->insert($dados);