app/Controllers/UF.php

    public function preparaMunicipios()
    {
        $id_uf = $this->request->getvar('id_uf');

        $municipios = $this->municipio_model
                            ->where('id_uf', $id_uf)
                            ->findAll();
---
SELECT *
FROM `municipios`
WHERE `id_uf` = '17'